Repository: Turbo1123/Turbo-IO
Catalog: apps/RayNeoCompanion/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Stop / Resend Off Command
zh_hans: 停止 / 重发关闭

source: I Confirmed the Glasses Feature Is Off
zh_hans: 我已确认眼镜关闭

source: Use only after visually confirming All-Day Notes is off on the glasses. A successful switch acknowledgment is not proof of OFF status. Manual confirmation is recorded separately.
zh_hans: 只在目视确认眼镜全天智记已关闭后使用；开关成功回执不等于 OFF 状态，人工确认单独记录。

source: Inform people nearby and use test phrases before starting. AI voice standby will pause and cloud audio capture will not resume automatically afterward. Disconnection or force quit cannot guarantee an immediate remote stop. Keep the glasses connected to your phone and observe them.
zh_hans: 开始前请告知周围人并使用测试语句。会暂停 AI 语音待命；结束后不会自动恢复云收音。断连或强退不能保证远端立即停止，请保持眼镜与手机连接并观察。

source: Protocol Events (No Audio Content)
zh_hans: 协议事件（无音频正文）

source: Have you checked the glasses and confirmed All-Day Notes is off? This records manual confirmation, not a protocol verification pass.
zh_hans: 确认已查看眼镜，全天智记已关闭？这会记录人工确认，不标记为协议验证通过。

source: Confirm Glasses Feature Is Off
zh_hans: 确认眼镜已关闭

source: Local Structure Inspection
zh_hans: 本机结构检查

source: A valid container does not prove usable sound.
zh_hans: 容器通过，不等于声音可用。

source: Checks only a subset of Ogg / Opus declarations. Does not play, decode, or run speech recognition.
zh_hans: 只检查一个 Ogg / Opus 声明子集，不播放、不解码、不运行语音识别。

source: This recording is not in the current archive. Go back and refresh.
zh_hans: 此录音不在当前归档中，请返回刷新。

source: Inspection Scope and Resources
zh_hans: 检查范围与资源

source: Single stream, non-chained, Opus v1, mapping 0, one or two channels. CRC, page sequence, packet boundaries, and granule positions provide structural evidence only. They do not prove the original wireless transfer had no packet loss.
zh_hans: 单流、非串接、Opus v1、mapping 0、1 或 2 声道。CRC、页序、包边界和 granule 只提供结构证据，不证明原始无线无丢包。

source: Reads in 64 KiB chunks. Input limit: 64 MiB; packet limit: 1 MiB. Stops at the budget without automatically increasing it. Only one inspection can run, with no waiting queue.
zh_hans: 64 KiB 分块读；输入上限 64 MiB、包上限 1 MiB。超过预算停止，不自动加大。仅一个检查任务，不建立等待队列。

source: Leaving this page cancels inspection and clears results. Reopening does not automatically inspect. File changes or archive issues invalidate old results. After cancellation, wait for resources to be released before restarting.
zh_hans: 离开此页会取消并清除结果；重新进入不自动检查。文件变化或归档异常使旧结果失效。取消后须等资源释放才能重新开始。

source: Clear Results to Inspect Again
zh_hans: 清除结果以重新检查

source: Clears only the displayed results. Audio and notes are not deleted.
zh_hans: 仅清除界面结果，不删除音频或笔记。

source: Verifying the local archive copy…
zh_hans: 正在核验本机归档副本…

source: Inspecting in chunks…
zh_hans: 正在分块检查…

source: Waiting for previous work and monitor to stop…
zh_hans: 等待旧工作与监视器退出…

source: Cancel Inspection
zh_hans: 取消检查

source: Inspect Audio Container
zh_hans: 检查音频容器

source: Not inspected yet. Opening this page does not read audio.
zh_hans: 尚未检查；打开页面不会读取音频。

source: The inspected stream's SHA-256 matches the archive record above. It applies only to these local bytes from this run.
zh_hans: 检查流 SHA-256 已与以上归档记录核对；只对应这一次本机字节。

source: Ogg Pages / CRC-Verified Pages
zh_hans: Ogg 页 / CRC 通过页

source: Audio Packets / Total Packets Including Headers
zh_hans: 音频包 / 含头总包

source: Channels / Pre-Skip
zh_hans: 声道 / pre-skip

source: First / Last Granule
zh_hans: 首 / 末 granule

source: Final PCM Position
zh_hans: 末 PCM 位置

source: Time Position at 48 kHz
zh_hans: 48 kHz 时间位置

source: %.4f seconds
zh_hans: %.4f 秒

source: Peak Parsed Page Buffer
zh_hans: 解析页缓冲峰值

source: The time position is not a measured recording or decoding duration. Peak page buffer is not total app memory. TOC, actual packet duration, and consistency with granule increments have not been checked.
zh_hans: 时间位置不是测得录音或解码时长；页缓冲峰值不是整个 App 内存。TOC、实际包时长与 granule 增量一致性尚未检查。

source: Not Decoded · No ASR · Not Uploaded
zh_hans: 未解码 · 未执行 ASR · 未上传

source: Local Head Gesture Test
zh_hans: 本机头控测试

source: Sends only one to-do suggestion card. Nod/shake results appear only on this page and never call the network, Core, or automation.
zh_hans: 仅发送一张待办建议卡。点头/摇头只在本页显示结果，绝不会调用网络、Core 或自动化。

source: Title
zh_hans: 标题

source: Source
zh_hans: 来源

source: Content
zh_hans: 内容

source: Send 30-Second Head Gesture Test Card
zh_hans: 发送 30 秒头控测试卡

source: Remove Test Card Now
zh_hans: 立即移除测试卡

source: Protocol scope: business 21. Sends type 33, then deletes the card and sends a type 35 acknowledgment after a matching type 34 response. Unverified responses are ignored.
zh_hans: 协议范围：业务 21；下发 type 33，匹配 type 34 回传后删除并发送 type 35 回执。未验证的回传会被忽略。

source: Import Selected To-Dos from iPhone Reminders
zh_hans: 从 iPhone 的提醒事项导入所选待办

source: Grant access, then choose a list. Copies only selected items' titles, completion status, and scheduled times. Does not import notes, attachments, locations, or contacts.
zh_hans: 先授权、再选清单。仅复制勾选条目的标题、完成状态和计划时间；不导入备注、附件、位置或联系人。

source: On iOS 17 and later, the permission is called “Full Access,” but Turbo IO only reads and does not change system reminders. Importing does not automatically send items to the glasses or create notifications.
zh_hans: iOS 17 起系统权限名为“完全访问”，但Turbo IO仅执行读取，不修改系统待办。导入不会自动发送到眼镜，也不创建通知。

source: Synthetic Test Mode · Does Not Read System Data
zh_hans: 合成测试模式 · 不读取系统数据

source: Grant Access and Read Lists
zh_hans: 授权并读取清单

source: Loading…
zh_hans: 读取中…

source: Choose List
zh_hans: 选择清单

source: System List
zh_hans: 系统清单

source: Select
zh_hans: 请选择

source: Read Selected List
zh_hans: 读取所选清单

source: Reads only this list, without system smart-list rules. Source snapshots are limited to 500 items. Over-limit lists are not truncated and presented as complete.
zh_hans: 只读取该清单，不包含系统智能列表规则。来源快照最多 500 条；超限时不截取冒充完整列表。

source: Choose Items to Import
zh_hans: 选择要导入的条目

source: Show Completed
zh_hans: 显示已完成

source: Completed in Reminders
zh_hans: 系统已完成

source: Incomplete in Reminders
zh_hans: 系统未完成

source: This is a one-time copy, not continuous sync. Titles are limited to 300 characters. Recurrence rules, subtask relationships, notes, and system alerts are not copied. System originals stay unchanged.
zh_hans: 这是一次性复制，不持续同步。标题最多保留 300 字；不复制重复规则、子任务关系、备注或系统提醒。系统原件保持不变。

source: Clear Import Preview
zh_hans: 清除读取预览

source: Repeated imports of the same source ID are skipped, including locally removed to-dos. Local edits are not overwritten, and removed items are not restored automatically. If system sync recreates source IDs, they may still be treated as new items.
zh_hans: 同一来源标识重复导入会跳过，包括已移除的本机待办，不覆盖编辑也不自动恢复。系统同步若重建来源标识，仍可能视为新条目。

source: System Reminders
zh_hans: 系统提醒事项

source: Copy the selected items into Turbo IO? System Reminders will stay unchanged, and nothing will be sent to the glasses immediately.
zh_hans: 将所选条目复制到Turbo IO？不修改系统提醒事项，也不立即发送眼镜。

source: Confirm Import into Turbo IO Only
zh_hans: 确认仅导入Turbo IO

source: %@ · %@ · %@°C → Glasses %@°C
zh_hans: %@ · %@ · %@°C → 镜片 %@°C

source: Fetched: %@. Cached locally for up to 10 minutes. The API provides no observation time; the fetch time is not the observation time.
zh_hans: 获取：%@；本机缓存最多 10 分钟。接口没有观测时间，获取时间不代表观测时间。

source: Weather code %@ does not automatically match a firmware icon. Send a candidate test with the same ID and visually verify it before enabling automatic updates for this type.
zh_hans: 天气码 %@ 不自动等于固件图标；先发送同号候选测试，目视核对后才能启用该类型自动下发。

source: Phone: %@ · Glasses report: %@
zh_hans: 手机：%@ · 眼镜回报：%@

source: Important flag: Phone %@ · Glasses %@
zh_hans: 重要标记：手机 %@ · 眼镜 %@

source: Received %@
zh_hans: 已接收 %@

source: %@ characters/minute candidate
zh_hans: %@ 字/分钟候选

source: Selected city: %@
zh_hans: 已选城市：%@

source: Automatic query: %@ %@°C · %@ · Weather code %@
zh_hans: 自动查询：%@ %@°C · %@ · 天气码 %@

source: Save the verified firmware icon for Weatherstack code %@. If the weather type changes, updates pause until the new code is verified.
zh_hans: 为 Weatherstack 天气码 %@ 保存已验证的固件图标；天气类型变化后，未核对的新代码会暂停下发。

source: Local time: %@
zh_hans: 当地时间：%@

source: Weatherstack code: %@ (not a glasses icon ID)
zh_hans: Weatherstack 代码：%@（不是眼镜图标编号）

source: Recorded %@ · Local ID %@
zh_hans: 已记录 %@ · 本机编号 %@

source: %@ · %@ reading segments
zh_hans: %@ · %@ 个阅读分段

source: %@ seconds
zh_hans: %@ 秒

source: Glasses-reported master switch: %@ (not an acknowledgment for each source)
zh_hans: 眼镜报告总开关：%@（不是来源逐项回执）

source: Applies the master switch, each listed app’s switch (including Phone), and the draft duration: displayTime=%@, avoidDuplicate=false, intervalTime=2. This is not the original configuration read from the glasses. Unlisted apps are not guaranteed to be blocked.
zh_hans: 将应用总开关、列表中各 App（含电话）的开关和停留时间草稿：displayTime=%@、avoidDuplicate=false、intervalTime=2。不是从眼镜读回的原配置；未列出的 App 不保证被拦截。

source: Title %@/80 · Body %@/500 · Test limits for this version, not a guarantee of glasses layout
zh_hans: 标题 %@/80 · 正文 %@/500 · 这是本版测试上限，不是镜片排版保证

source: Latest UID: %@
zh_hans: 最近一次 UID：%@

source: Turn %@
zh_hans: 轮次 %@

source: %@ turns completed
zh_hans: 已完成 %@ 轮

source: Sample question: %@
zh_hans: 示例提问：%@

source: Sample response: %@
zh_hans: 示例回答：%@

source: %@ abnormal or unknown directories are left in place; moving them is not available.
zh_hans: %@ 个异常或未知目录保留原位，不提供移动操作。

source: Current phase: %@ seconds remaining Received %@ packets / %@ bytes Saved %@ packets / %@ bytes (tail packets %@) Discarded %@ packets / %@ bytes
zh_hans: 当前阶段剩余 %@ 秒 收到 %@ 包 / %@ 字节 保存 %@ 包 / %@ 字节（尾包 %@） 丢弃 %@ 包 / %@ 字节

source: Local raw packets: %@ Not presented as playable audio until the format is verified. Does not query or delete old caches on the glasses.
zh_hans: 本机原包：%@ 未验证格式前不伪装为可播放录音；不查询或删除眼镜旧缓存。

source: File %@ · Inspection limit 64 MiB
zh_hans: 文件 %@ · 检查上限 64 MiB

source: Archive record SHA-256 %@
zh_hans: 归档记录 SHA-256 %@

source: Archive verification found an issue. Return to Details and complete a full recheck first. %@
zh_hans: 归档校验存在异常，请返回详情先完整复核。 %@

source: Inspection time: %@
zh_hans: 检查时间：%@

source: %@ selected (up to 100). Hiding completed items clears the selection to prevent accidental imports.
zh_hans: 已选 %@ 条（最多 100 条）；隐藏已完成条目时会清除选择，避免误导入。

source: Import Selected into Turbo IO (%@)
zh_hans: 导入所选到Turbo IO（%@）

source: Incomplete
zh_hans: 未完成

source: Yes
zh_hans: 是

source: No
zh_hans: 否

source: Not provided
zh_hans: 未提供

source: Cloud conversation
zh_hans: 云对话

source: Cloud conversation inactive
zh_hans: 云对话未运行

source: Completed locally
zh_hans: 本机已完成

source: Incomplete locally
zh_hans: 本机未完成

source: Unknown; import time is not recording time
zh_hans: 未知，不以导入时间替代

source: Missing
zh_hans: 缺失

source: On
zh_hans: 开

source: Off
zh_hans: 关

source: Present
zh_hans: 存在

source: %@ bytes
zh_hans: %@ 字节

source: Status Conflict · Local Edits Retained
zh_hans: 状态冲突 · 本机修改已保留

source: Completed Locally · Not Synced
zh_hans: 本机已完成 · 未同步

source: Saved Only on Phone
zh_hans: 仅保存在手机

source: Pending Send · Local Edits Saved
zh_hans: 待发送 · 本机修改已保存

source: Submitted · Items Not Individually Confirmed
zh_hans: 已提交 · 未逐项确认

source: Linked to Glasses · Awaiting Report
zh_hans: 已关联眼镜 · 以回报为准

source: Start / Continue Task
zh_hans: 发起 / 继续任务

source: Check Progress and Results
zh_hans: 查询进度与结果

source: Stop Current Task
zh_hans: 停止当前任务

source: Call only when the user explicitly asks Codex to run or continue a coding task. Sends to the task selected in the app, creating one only if none is selected. Not for ordinary chat or permission approvals.
zh_hans: 仅当用户明确要求Codex执行或继续编程任务时调用。发送到App选中的任务，未选择才新建；不适用于普通聊天或权限审批。

source: Call when the user asks about the progress or results of the current Codex task.
zh_hans: 用户询问Codex当前任务的进度或结果时调用。

source: Call only when the user explicitly asks to stop the current Codex task. Stopping spoken playback does not stop Codex.
zh_hans: 仅用户明确要求停止Codex当前任务时调用。停止回复朗读不等于停止Codex。

source: Ask Codex to inspect this project’s directory structure
zh_hans: 让 Codex 检查一下这个项目的目录结构

source: Has Codex finished? What are the results?
zh_hans: Codex 做完了吗？结果是什么？

source: Stop the current Codex task
zh_hans: 停止 Codex 当前任务

source: Declared Structure Subset Passed Inspection
zh_hans: 声明子集的结构检查通过

source: Not Supported by This Inspector
zh_hans: 当前检查器不支持

source: Container Structure Error Found
zh_hans: 发现容器结构错误

source: Inspection Budget Exceeded
zh_hans: 超出本次检查预算

source: Dashboard weather: configure your QWeather host and key.
zh_hans: 仪表盘实时天气：待配置和风 Host / Key。

source: Dashboard weather has not been sent yet.
zh_hans: 尚未发送仪表盘天气。

source: Unable to save configuration.
zh_hans: 配置保存失败。

source: Connection or configuration changed. Previous acknowledgments are no longer used.
zh_hans: 连接或配置已变化，旧回执不沿用。

source: No home weather acknowledgment observed within 8 seconds. Nothing was resent automatically; the glasses may still have displayed it.
zh_hans: 8 秒内未观察到首页天气回执；未自动重发，不代表镜片一定未显示。

source: Automatic dashboard weather is off.
zh_hans: 仪表盘自动天气已关闭。

source: Waiting for an authenticated glasses connection. Nothing has been fetched or sent.
zh_hans: 等待眼镜认证连接，未查询或下发。

source: Waiting for voice, recording, or teleprompter use to end before updating the dashboard.
zh_hans: 等待语音、录音或提词结束后更新仪表盘。

source: Query interval limit: wait at least 60 seconds before fetching again.
zh_hans: 查询间隔保护，满 60 秒后再查询。

source: Weather fetched. Waiting for the glasses to become idle.
zh_hans: 已获取天气，等待眼镜空闲。

source: Weather request or submission failed.
zh_hans: 天气请求或下发失败。

source: current_weather_update submitted. Waiting for a type 19 acknowledgment of the same command.
zh_hans: 已提交 current_weather_update，等待 type19 同命令回执。

source: SDK send failed. Receipt by the glasses is unconfirmed.
zh_hans: SDK 发送失败，未确认眼镜接收。

source: Candidate test not sent: connection, data freshness, or idle requirements were not met.
zh_hans: 候选测试未发送：连接、数据时效或空闲状态不满足。

source: Enter a valid dedicated QWeather host without a path, a location, and coordinates with two decimal places.
zh_hans: 请输入有效的和风专属 Host（不带路径）、地点和两位小数经纬度。

source: Save the QWeather API key for this host. Keys from other services are not reused.
zh_hans: 请保存该 Host 的和风 API Key；不会复用其他服务的密钥。

source: QWeather response fields, units, or attribution are incomplete. Nothing was sent.
zh_hans: 和风响应字段、单位或归因信息不完整，未下发。

source: The weather fetch has expired. Fetch again; response time is not treated as observation time.
zh_hans: 天气获取时间已过期，需重新查询；未把响应时间当观测时间。

source: QWeather request failed or timed out. Nothing was sent; no automatic downgrade or redirect following.
zh_hans: 和风天气网络请求失败或超时，未下发；不自动降级或跟随重定向。

source: Hermes bridge not checked yet
zh_hans: 尚未检查 Hermes 桥接

source: Glasses communication core not loaded yet
zh_hans: 尚未加载设备通信核心

source: Glasses wake settings not queried yet
zh_hans: 尚未查询眼镜唤醒设置

source: No custom wake word write test yet
zh_hans: 尚未试写自定义唤醒词

source: Glasses features are available after connecting. Audio capture has not started automatically.
zh_hans: 连接后可使用眼镜功能；未自动开始采音

source: Glasses recording reception is off
zh_hans: 未启用眼镜录音接收

source: Not Synced Yet
zh_hans: 尚未同步

source: Scans this device only; does not access the glasses.
zh_hans: 仅扫描本机，不访问眼镜。

source: No Script Sent Yet
zh_hans: 尚未发送稿件

source: Local draft; glasses settings have not been read or changed
zh_hans: 本机草稿；未读取或修改眼镜设置

source: Shared notification status unknown
zh_hans: 共享通知状态未知

source: Not sent yet; business notifications do not pass through iOS Notification Center
zh_hans: 尚未发送；业务通知不经过 iOS 通知中心

source: Computer bridge not connected yet
zh_hans: 尚未连接电脑桥接

source: Cancelling; original audio retained…
zh_hans: 正在取消，原音频保留…

source: Verifying local audio…
zh_hans: 校验本机音频…

source: Decoding locally to 16 kHz mono…
zh_hans: 本机解码为 16 kHz 单声道…

source: Transcribing manually; audio is being sent to Alibaba Cloud…
zh_hans: 手动转写中，音频正在发往阿里云…

source: Saving a new text revision…
zh_hans: 保存新文字修订…

source: Recognition finished, but the note was not saved. You can copy the text below; the original audio remains.
zh_hans: 识别已完成但笔记未保存，可复制下方文字；原音频保留。

source: Transcription saved as a new Markdown revision. Please review the recognized text.
zh_hans: 转写完成，已保存为新 Markdown 修订；请核对识别内容。

source: Further processing cancelled. The original audio and saved revisions remain.
zh_hans: 已取消后续处理；原音频和已提交修订保留。

source: Transcription did not finish; the connection may have dropped or the task was cancelled. Original audio remains.
zh_hans: 转写未完成，可能断网或已取消；原音频保留。

source: Off; observation data is not exported
zh_hans: 已关闭；不会导出观察数据

source: Starting
zh_hans: 启动中

source: USB observer enabled · Turns off automatically after 30 minutes
zh_hans: USB 观察接口已开启 · 30分钟后自动关闭

source: Observer failed to start; no LAN port was exposed
zh_hans: 接口启动失败；未暴露局域网端口

source: Observer interface unavailable
zh_hans: 观察接口不可用

source: Off; observation data from this session cleared
zh_hans: 已关闭并清空本轮观察数据

source: No test card sent yet
zh_hans: 尚未发送测试卡

source: Test card removal requested
zh_hans: 已请求移除测试卡

source: Connection changed; no longer waiting for this test card
zh_hans: 连接变化；已停止等待这张测试卡

source: Nod confirmation received (test callback only)
zh_hans: 已收到点头确认（仅测试回调）

source: Shake cancellation received (test callback only)
zh_hans: 已收到摇头取消（仅测试回调）

source: Test timed out; no action taken
zh_hans: 测试已超时；不执行任何操作

source: Preparing local receiving folder
zh_hans: 准备本机接收目录

source: Start requested; waiting for glasses response
zh_hans: 已请求开始，等待眼镜回应

source: Sync list received; offline backlog is not imported or cleared automatically
zh_hans: 收到同步列表；本版不自动导入或清理离线积压

source: Glasses recording accepted; waiting for data
zh_hans: 已接受眼镜录音，等待数据

source: Glasses confirmed recording started
zh_hans: 眼镜已确认开始录音

source: Receiving and saving original audio
zh_hans: 正在接收并保存原始音频

source: Glasses reported completion; checking received data and finalizing
zh_hans: 眼镜已报告完成，核对接收覆盖并封装

source: Stop event received; waiting for audio completion
zh_hans: 停止事件已收到，等待音频完成

source: Recording reconnect status received; continuing offset verification
zh_hans: 收到同一录音重连状态；继续按 offset 校验

source: Received data and packet decoding passed; WAV awaits archiving. Original audio and Ogg remain. Wireless source integrity is unverified.
zh_hans: 接收覆盖和逐包解码通过；WAV 待归档，原始音频/Ogg 保留。不代表无线原音无损。

source: Finalization failed; original bytes and receipt records retained
zh_hans: 未能完成封装；原始字节和覆盖记录已保留

source: Query sent; waiting for glasses status
zh_hans: 已查询，等待眼镜状态

source: Custom weather data submitted; dashboard layout unchanged. Waiting for receipt.
zh_hans: 自定义天气数据已提交；不更改看板组件布局，等待回执

source: Settings submitted; waiting for glasses report before updating displayed values
zh_hans: 设置已提交，等待眼镜回报；不提前改显示值

source: General glasses settings received
zh_hans: 眼镜通用设置已收到

source: Script preparation requested; waiting for glasses response. Follow-along and microphone remain off.
zh_hans: 已请求准备稿件，等待眼镜回应；本次不启用跟读/麦克风

source: Preparation timed out; script receipt unconfirmed. Scrolling will not start automatically. Exit to cancel this turn.
zh_hans: 准备超时；未确认收稿，不会自动开始滚动。可点退出取消本轮。

source: File channel submitted; waiting for script receipt. Playback has not started.
zh_hans: 专用文件通道已提交，等待业务收稿确认；尚未开始播放

source: Business success received after file submission; you can test start. File verification and glasses display remain unconfirmed.
zh_hans: 文件提交后收到业务成功回应，可测试开始；尚无独立文件校验/镜片证明

source: Glasses requested pause
zh_hans: 眼镜请求暂停

source: Glasses requested resume
zh_hans: 眼镜请求恢复

source: Glasses requested exit
zh_hans: 眼镜已请求退出

source: Fetching live weather for %@ to show on the dashboard home page.
zh_hans: 获取%@实时天气，目标为仪表盘首页。

source: %@ %@°C · %@ fetched. Test candidate icon %@; nothing was sent automatically.
zh_hans: %@ %@°C · %@ 已获取；请测试候选图标 %@，尚未自动下发。

source: Dashboard update submitted: %@ %@°C · %@; icon %@ is an unverified candidate. This does not update the weather card.
zh_hans: 仪表盘已提交：%@ %@°C · %@；图标 %@ 为待验候选。不是天气卡片更新。

source: Dashboard update submitted: %@ %@°C · %@; icon %@ was manually verified. This does not update the weather card.
zh_hans: 仪表盘已提交：%@ %@°C · %@；图标 %@ 已人工核对。不是天气卡片更新。

source: Confirmed matching icon for weather code %@. Future authenticated connections can send this type automatically.
zh_hans: 已记录用户确认：天气码 %@ 的同号图标；后续认证连接可自动下发此类型。

source: Glasses reported current_weather_update value=%@ (protocol success value). The receipt has no request ID; confirm the displayed content.
zh_hans: 眼镜回报 current_weather_update value=%@（协议成功值）；回执没有请求 ID，镜片内容仍需确认。

source: Glasses reported current_weather_update value=%@. The receipt has no request ID; confirm the displayed content.
zh_hans: 眼镜回报 current_weather_update value=%@；回执没有请求 ID，镜片内容仍需确认。

source: Test card sent; waiting for nod or shake (%@ seconds)
zh_hans: 测试卡已发送；等待点头或摇头（%@ 秒）

source: Temperature: %@
zh_hans: 温度 %@

source: Teleprompter connection lost. Restore the connection, exit, and prepare again before using automatic controls.
zh_hans: 提词连接中断；停止自动操作，请恢复连接后退出并重新准备

source: Glasses rejected start, code=%@; privacy and conflict safeguards were not bypassed.
zh_hans: 眼镜拒绝开始，code=%@；未自动绕过隐私/冲突

source: Submitted %@ to-dos; waiting for glasses status or action receipt. Display on the lenses is unconfirmed.
zh_hans: 已提交 %@ 条待办；等待眼镜状态/操作回执，不代表镜片已显示

source: Glasses action receipt: %@ succeeded; individual display remains unverified.
zh_hans: 眼镜操作回执：成功 %@；不作为逐项镜片验收

source: Applied %@ glasses status updates. Review offline conflicts in pending sends; unknown IDs were not imported.
zh_hans: 眼镜状态已应用 %@ 项；离线修改冲突请查看待发送列表，未知 ID 不导入

source: Glasses reported %@: %@. Display on the lenses is unverified.
zh_hans: 眼镜回报 %@：%@（未验证镜片效果）

source: Control type%@ submitted; waiting for glasses response.
zh_hans: 控制 type%@ 已提交，等待眼镜回应

source: Preparation rejected, code=%@; conflict was not resolved automatically.
zh_hans: 准备被拒绝 code=%@，未自动处理冲突

source: Teleprompter start response code=%@
zh_hans: 开始提词回应 code=%@

source: Glasses progress: original UTF-8 offset %@
zh_hans: 眼镜进度回传：UTF-8 原始偏移 %@

source: Glasses response type%@ code=%@
zh_hans: 眼镜回应 type%@ code=%@

source: Hermes alerts are off.
zh_hans: Hermes 提醒已关闭。

source: Hermes alerts enabled. Only new task updates will be announced.
zh_hans: Hermes 提醒已开启，只提示新出现的任务动态。

source: Hermes alert delivery is uncertain. It will not be retried automatically.
zh_hans: Hermes 提醒发送结果未知，不会自动重发。

source: Hermes alert submitted. Confirm on the glasses; approval stays on iPhone.
zh_hans: Hermes 提醒已提交；请看眼镜确认，审批仍在 iPhone 上完成。

source: Hermes needs approval. Review on your iPhone.
zh_hans: Hermes 需要审批，请在 iPhone 上查看。

source: Hermes needs an answer. Review on your iPhone.
zh_hans: Hermes 需要你回答，请在 iPhone 上查看。

source: Hermes needs an action on your computer. Review on your iPhone.
zh_hans: Hermes 需要在电脑上处理，请在 iPhone 上查看。

source: Hermes task finished. Open Norman IO for the result.
zh_hans: Hermes 任务已完成，打开 Norman IO 查看结果。

source: Hermes task failed. Open Norman IO for details.
zh_hans: Hermes 任务失败，打开 Norman IO 查看详情。

source: Hermes task needs verification on your computer.
zh_hans: Hermes 任务需要在电脑上核对。

source: Notify on Glasses When Hermes Needs Attention
zh_hans: Hermes 需要处理时提醒眼镜

source: Only short, generic reminders appear on the glasses while iOS can run. Review task details and approve only on this phone.
zh_hans: 仅在 iOS 允许 App 运行时向眼镜发送简短通用提醒。任务详情和审批仅在这部手机上处理。

source: Waiting for glasses connection and notification settings to allow a Hermes alert.
zh_hans: 等待眼镜连接及通知设置允许后，再提示 Hermes 任务动态。
